{
    "intents": [
        {
            "tag":"greetings",
            "patterns": [
                "Hello",
                "Hey",
                "How are you",
                "Is anyone there",
                "Good morning",
                "Good day",
                "Hi"
            ],
            "responses": [
                "Hey :-)",
                "Hello, Welcome!!",
                "Hi there , what can I do for you?",
                "Hi there, how can I help you?"
            ]
        },
        {
            "tag":"goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye"
                
            ],
            "responses": [
                "See you later, thanks for visiting",
                "Have a nice day",
                "Bye! Come back again soon.",
                "Hope the data was useful for you"
                
            ]
        },
        {
            "tag":"thanks",
            "patterns": ["Thanks", "Thank You"," That's helpful","Thanks a lot!!","Okay,thank you"],
            "responses":["Happy to help","Any time!","My pleasure"]
        },
        {
            "tag":"mobile data",
            "patterns": [
                "What plans do you offer for mobile data?"
                
           ],
            "responses":[
                "We offer a variety of mobile data plans tailored to different usage needs. You can choose from our Basic, Standard, and Premium data plans, each offering different data allowances and features",
               
            "Basic,Standard and Premium data plans"]
        },
        {
            "tag":"network connection",
            "patterns": [
                "I'm facing network issues in my area. What should I do?", 
               
                "I m having trouble with my network connection"
               ],
            "responses":[
                "I'm sorry to hear that you're experiencing network issues. Please provide me with your current location, including the city and any nearby landmarks. I'll check if there are any ongoing maintenance activities or outages in your area. If not, I'll guide you through some troubleshooting steps to improve your network connection.Can you tell me more about that?",
                "I am sorry to hear that,Can you tell me more about the problem?"
            ]
        },
        {
            "tag":"internet dropping",
            "patterns":["My internet is really slow and it keeps dropping out"],
            "responses":["I see. That sounds like a problem with your modem.Can you please check the power and cables to make sure they're connected properly?"]
        },
        {
            "tag":"already checked",
            "patterns":["Yes,I've already checked that."],
            "responses":["In that case I would recommend contacting our technical support team for further assistance."]
        },
        {
            "tag":"data usage",
            "patterns": [
                "How can I check my current data usage?",
                "How much data did I consume ?"
               ],
            "responses":[
                "You can easily check your current data usage by logging into your account on our website or using our mobile app. Alternatively, you can text 'USAGE' to 12345 from your registered mobile number, and we'll send you an update on your remaining data balance.",
                "Dial 12345 from your registered mobile number"
            ]
        },
        {
            "tag":"International Roaming",
            "patterns":["How do I activate international roaming?",
            "What are the steps to activate international roaming?"
        ],
            "responses":["To activate international roaming, you can log in to your account on our website or use our mobile app. Navigate to the 'Roaming' section and follow the prompts to activate roaming for the countries you plan to visit. Keep in mind that international roaming rates may apply, so it's a good idea to check our website for the latest rates before your trip.",
        "In your mobile app navigate to roaming section"]
        },
        {
            "tag":"Plan",
            "patterns":["How can I change my current plan?",
                        "How to choose a current plan?"],
            "responses":["Changing your plan is easy. You can log in to your account, navigate to the 'Plan' section, and select the 'Change Plan' option. Choose the plan that best suits your needs, and the changes will take effect from your next billing cycle.",
                         "After logging in your account ,check the choose plans option and select the best suited for you."]
        },
        {
            "tag":"Sim card",
            "patterns":["What's the process for getting a new SIM card?",
                        "How to get a new Sim card?"],
            "responses":["To get a new SIM card, you can visit any of our retail stores. Our staff will assist you in selecting the right SIM card for your device and help you with the activation process. Don't forget to bring a valid photo ID for verification.",
        "Visit our airtel store with a valid photo ID select the sim which you want"]
        },
        {
            "tag":"Voice mail",
            "patterns":["How do I set up voicemail?",
        "How to get voice mail?"],
            "responses":["Dial *123 from your phone and follow the prompts to set up your voicemail box",
                        "You can record a personalized greeting and manage your voicemail settings through the prompts as well."]
        },
        {
            "tag":"upgrade phone",
            "patterns":["Can I upgrade my phone?"],
            "responses":["Of course! We offer a range of smartphones for upgrade. To see your eligibility and explore available options, please provide me with your account number or registered phone number. I'll check if you're eligible for an upgrade and show you the latest devices you can choose from."]
        },
        {
            "tag":"airtel postpaid",
            "patterns":["What is Airtel Postpaid?"],
            "responses":["Postpaid is a telecom service plan where you are billed a predetermined amount at the end of the month of usage. The month is called the billing cycle and may not refer to a calendar month"]
        },
        {
            "tag":"4g sim",
            "patterns":["How can I upgrade my SIM to Airtel 4G SIM?"],
            "responses":["You can upgrade to Airtel 4G SIM easily by registering your details here to receive the new Airtel 4G SIM at your doorstep. The new SIM will be sent to you soon and will also have instructions on how to activate the SIM with your number."]
        },
        {
            "tag":"switch airtel prepaid",
            "patterns":["How to switch from Airtel Prepaid to Postpaid?"],
            "responses":["To switch from Airtel prepaid to Airtel postpaid, all that you need to do is; 1.Go to the Airtel website. 2.Click on the Prepaid dropdown and then click on the “Switch prepaid to postpaid page”. 3.Once you choose the plan that you would like to opt for, fill up all your details on the form."]
        },
        {
            "tag":"services",
            "patterns":["What services do you offer?", "Tell me about your services"],
            "responses":["We offer a wide range of services, including mobile plans, internet, DTH, and more. How can I assist you with our services today?"]
        },
        {
            "tag":"internet plans",
            "patterns":["What internet plans do you offer?", "Tell me about your internet packages"],
            "responses": ["We provide high-speed internet plans, including broadband and 4G. Please specify your location, and I'll share available plans."]
        },
        {
            "tag":"contact support",
            "patterns":["How can I contact customer support?", "Customer support contact"],
            "responses": ["You can reach our customer support team at 1-800-123-4567. Our agents are available 24/7 to assist you."]
        },
        {
            "tag":"other",
            "patterns": ["Tell me more", "I have another question"],
            "responses":["Sure, I'm here to help. Please ask your question."]
        },
        {
            "tag":"call forward",
            "patterns":["How do I set up call forwarding on my phone?"],
            "responses":["To set up call forwarding, open your phone's dialer and enter the appropriate forwarding code followed by the destination number. For example, to forward all calls, dial '*72' followed by the number you want calls to be forwarded to. To disable call forwarding, dial '*73'"]
        },
        {
            "tag":"mobile hotspot",
            "patterns":["How do I set up a mobile hotspot?"],
            "responses":["Setting up a mobile hotspot is easy. On most smartphones, you can go to the settings menu, select 'Network & Internet,' and then choose 'Hotspot & Tethering.'From there, you can enable the hotspot and set a password. This will allow you to share your mobile data with other devices like laptops and tablets."]
        },
        {
            "tag":"phone change",
            "patterns":["What's the procedure for changing my phone number?"],
            "responses":["If you'd like to change your phone number, please visit one of our retail stores with a valid photo ID. Our staff will assist you in selecting a new number and updating it in our system. Keep in mind that there may be a fee associated with changing your phone number"]
        },
        {
            "tag":"warranty policy",
            "patterns":["What's the warranty policy for my device?"],
            "responses":["Most devices come with a manufacturer's warranty that covers defects and malfunctions. The duration and coverage may vary by device. You can check the warranty information on our website or contact our customer service for details. We also offer extended warranty plans for additional coverage."]
        },
        {
            "tag":"low data",
            "patterns":["Can I add more data to my plan if I'm running low?"],
            "responses":["Absolutely! If you're running low on data, you can log in to your account and navigate to the 'Add-Ons' section. Here, you can choose to add more data to your plan for the current billing cycle. This will help you avoid overage charges and stay connected."]
        },
        {
            "tag":"refund overrecharge",
            "patterns":["What's the process for requesting a refund for an overcharge?"],
            "responses":["If you believe you've been overcharged, you can contact our customer service hotline with your account details and the details of the charge in question. Our representatives will review the situation and assist you in resolving the issue and processing a refund if applicable."]
        },
        {
            "tag":"data charges",
            "patterns":["What are the charges for data pack?"],
            "responses":["For 1GB:Rs.200/month, 1.5GB:Rs.180, 2GB: Rs.220/month"]
        },
        {
            "tag":"unused data",
            "patterns":["What happens to my unused data from data packs ?"],
            "responses":["Any unused data from data packs will be added to the Rollover quota subject to maximum limit of 200GB"]
        },
        {
            "tag":"incoming free",
            "patterns":["Is incoming SMS free while roaming?"],
            "responses":["Yes"]
        },
        {
            "tag":"porting number",
            "patterns":["What are the charges to be paid for porting a mobile number?"],
            "responses":["The upper limit for the Per Port Transaction Charge is Rupees six and forty-six paisa only for each porting request, if asked by the operator to whom you wish to submit the request."]
        },
        {
            "tag":"broadband speed",
            "patterns":["What is the permissible minimum Broadband speed limit?"],
            "responses":["As per the regulation on “Quality of Service standards for Broadband Services” issued by TRAI on 6th October, 2006, a subscriber should get minimum 80% of the subscribed broadband connection speed from ISP Node to user."]
        },
        {
            "tag":"download speed",
            "patterns":[" What is the minimum download speed prescribed for broadband service provider?"],
            "responses":["As per quality of service of broadband service (Second Amendment) regulations, 2014 a minimum download speed of 512 kbps will be provided to an individual subscribers by the service provider."]
        },
        {
            "tag":"warranty policy",
            "patterns":["What's the warranty policy for my device?"],
            "responses":["Most devices come with a manufacturer's warranty that covers defects and malfunctions. The duration and coverage may vary by device. You can check the warranty information on our website or contact our customer service for details. We also offer extended warranty plans for additional coverage."]
        },
        {
            "tag":"new prepaid",
            "patterns":["What's the procedure for activating a new prepaid SIM card?"],
            "responses":["Activating a new prepaid SIM card is easy. Insert the SIM card into your phone and power it on. You'll receive a welcome message with activation instructions. Follow the prompts to complete the activation process, which may include selecting a plan and adding credit."]
        },
        {
            "tag":"conference call",
            "patterns":["How can I set up a conference call?"],
            "responses":["Setting up a conference call is easy. During a call, use the 'Add Call' or 'Conference' button on your phone's dialer. Dial the second participant's number, and when they answer, choose the 'Merge' or 'Conference' option. You can add more participants using the same process."]
        },
        {
            "tag":"phone plan",
            "patterns":["Can I change my phone plan in the middle of a billing cycle?"],
            "responses":["Yes, you can change your phone plan during a billing cycle. Log in to your account on our website and navigate to the 'Plan' or 'Services' section. Choose the option to change your plan and follow the prompts. The changes will typically take effect from your next billing cycle."]
        },
        {
            "tag":"fair speed",
            "patterns":["What is the fair speed usage limit in case of unlimited data plan?"],
            "responses":["This is the limit of data consumption upto which the subscriber get the promised speed. After the limit get exhausted, the speed is reduced. TRAI has mandated the Telecom Service Provider clearly specifying their fair usage limit and the data speed to be provided after the fair usage limit gets exhausted."]
        },
        {
            "tag":"balance after",
            "patterns":["I can't see my balance after the recharge"],
            "responses":["Sometimes,it takes up to 30 minutes for the mobile recharge benefits to reflect in your account."]
        },
        {
            "tag":"legacy system",
            "patterns":["What is a legacy system in telecom?"],
            "responses":["A telecom system is a network of communications facilities and equipment that are used to transmit voice, data, and video traffic. A legacy telecom system is an older system that has been in use for many years. These systems are often complex and expensive to maintain. However, they can be very reliable and offer a wide range of features. Legacy telecom systems are often replaced by newer, more modern systems. However, in some cases, these older systems may still be the best option for a particular application so an API (software intermediary) may be implemented to maintain a working connection."]
        },
        {
            "tag":"airtel benefits",
            "patterns":["I am not an Airtel Customer, how can I get access to these benefits?"],
            "responses":["To join the Airtel Thanks program, you must become an Airtel prepaid/ postpaid or broadband customer. To switch to Airtel, please visit your nearest Airtel Store."]
        },
        {
            "tag":"airtel rewards",
            "patterns":["What is ‘Airtel Rewards’?"],
            "responses":["Airtel Rewards is a program available only to Airtel Thanks App users on Android where they stand the chance to win exciting rewards from brands across several categories when they perform a specific set of tasks related to Airtel digital & telco products."]
        },
        {
            "tag":"find rewards",
            "patterns":[" How can I find rewards in my Airtel Thanks App?"],
            "responses":["To find your rewards (available, claimed or redeemed) or to understand what actions can earn you rewards, you can go to Airtel Thanks Android App home and tap on Discover airtelThanks. Your Thanks tier benefits will be visible. From here, you can switch tab to ‘Rewards’ to know all about Airtel Rewards."]
        },
        {
            "tag":"redeem reward",
            "patterns":["How do I redeem my reward?"],
            "responses":["Read through the terms of the offer, and if interested, you can click on ‘Redeem’ subsequently to navigate to the brand website to avail the reward / offer using the given coupon code. If you do not understand any condition or have another query regarding the reward, please reach out to the respective brand’s support mail ID or contact number listed on the reward page"]
        },
        {
            "tag":"airtel amazon prime",
            "patterns":["What is Prepaid Airtel Amazon Prime offer?"],
            "responses":["Airtel is offering Amazon Prime membership at no extra cost for its Prepaid customers recharging with a RS. 349 recharge. On recharging with the Rs 349 recharge, the customer gets Telco benefits of Unlimited Calling, 2GB data per day and Amazon Prime membership valid for for 28 days. With Amazon Prime membership customers can enjoy unlimited streaming anytime, anywhere movies and TV shows on Prime Video including the latest and exclusive blockbuster Hollywood, Bollywood and Indian Regional movies, top TV shows. In addition, members can get access to Prime Reading and unlimited free fast shipping on millions of items along with early and exclusive access to deals on www.Amazon.in"]
        },
        {
            "tag":"Rc 349",
            "patterns":[" Is this offer – RC 349: Amazon Prime prepaid available to All Airtel prepaid customers?"],
            "responses":["Yes, this recharge is open & available to All Airtel prepaid customers"]
        },
        {
            "tag":"Rs 349",
            "patterns":["What will happen if customer recharges with Rs 349 before his existing pack is expired?"],
            "responses":["The existing rule of Telco accretive validity will stay as is i.e. the current pack validity and benefit will remain as is. Once existing pack validity is over, benefits of 349 pack will start i.e, 2GB Data per day, UL calling and Amazon Prime membership for 28 days."]
        },
        {
            "tag":"Prime subscription",
            "patterns":["Will customer be charged anything extra from Amazon for Prime subscription?"],
            "responses":["No, customer won’t be charged anything extra for Amazon Prime subscription for 28 days"]
        },
        {
            "tag":"screen/devices",
            "patterns":["On how many screen / devices can I see the Prime video?"],
            "responses":["Prime video can be downloaded on multiple devices and be used with same login credentials however only 3 devices can simultaneously view the content."]
        },
        {
            "tag":"SOP",
            "patterns":["What is the SOP if customer has forgotten his Login ID?"],
            "responses":["Customer needs to contact Airtel and receive the entitlement ID from their customer support. Share this ID with Amazon customer support to get help with login credentials."]
        }
    ]
}
